Reports/ОбщиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОбщиеНастройки</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Листовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поганажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штучная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОбщиеНастройки/Ext/ObjectModule.bsl
Функция ПолучитьСписокИменРеквизитов(ТолькоНормы = Ложь) Экспорт

	мСписокИмен = Новый Массив;
	
	Если НЕ ТолькоНормы Тогда
		
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Листовая));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Штучная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Поганажная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Массив));
		
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Листовая));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Штучная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Поганажная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Прочее));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Массив));
		
		мСписокИмен.Добавить(ПолучитьИмяНастройкиСтараяЦена());
		мСписокИмен.Добавить(ПолучитьИмяПутьККорневойПапкеPDM());

		мСписокИмен.Добавить(ПолучитьИмяПутьКВремяОпросаФайлов());

		мСписокИмен.Добавить(ПолучитьНазваниеОрганизации());  

		мСписокИмен.Добавить(ПолучитьНачалаРабочегоДня());
		мСписокИмен.Добавить(ПолучитьОкончаниеРабочегоДня());
		мСписокИмен.Добавить(ПолучитьНачалаПерерыва());
		мСписокИмен.Добавить(ПолучитьОкончаниеПерерыва());

		мСписокИмен.Добавить(ПолучитьИмяПутьКАдрес_API_Telegramm());      
		
		мСписокИмен.Добавить(НаименованиеПапкаДляРазмещенияТЗ());
		мСписокИмен.Добавить(НаименованиеПапкаДляРазмещенияКомпозиций());
		мСписокИмен.Добавить(НаименованиеURLБазыЗнаний());
		мСписокИмен.Добавить(НаименованиеАвторИсполненияБэгТрека());        
		мСписокИмен.Добавить(НаименованиеПриУтвержденииПереноситьИзПапки());
		мСписокИмен.Добавить(НаименованиеПриУтвержденииУдалятьВПапке());        

		мСписокИмен.Добавить(НаименованиеДоскиДляТЗ());        
		мСписокИмен.Добавить(НаименованиеДоскиДляПроизводства());
		мСписокИмен.Добавить(НаименованиеКолонкиДляПроизводствоВМонтаж());
		мСписокИмен.Добавить(НаименованиеКолонкиОжиданиеПроизводства());
		мСписокИмен.Добавить(НаименованиеКолонкиПриостановкаПроизводства());
		мСписокИмен.Добавить(НаименованиеКолонкиОжиданиеГЧ());
		мСписокИмен.Добавить(НаименованиеКолонкиХранениеНаСкладе());
		мСписокИмен.Добавить(НаименованиеКолонкиДляВозвратаТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляОжиданияТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляСтадияСогласование());
		мСписокИмен.Добавить(НаименованиеКолонкиДляСтадияСогласовано());
		мСписокИмен.Добавить(НаименованиеКолонкиДляСтадияТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляСтадияПодтвержденияТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляТегаКомментарий());    

		мСписокИмен.Добавить(ПолучитьИмяИнтервалОпросаСообщений());    
		мСписокИмен.Добавить(ПолучитьИмяУчетнаяЗаписьОтправкиСообщения());    
		мСписокИмен.Добавить(ПолучитьИмяТемаОтправкиСообщения());    
		мСписокИмен.Добавить(ПолучитьИмяШаблонОтправкиТекстаСообщения());    

		омMsSQL.ПолучитСписокРеквизитовДляПодключенияКPDM(мСписокИмен);
		
		ПолучитСписокРеквизитовДляНормВремени(мСписокИмен);  
		
		
		Возврат мСписокИмен;                       
	Иначе
		стСписокИмен = Новый Структура();
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Листовая),Перечисления.ТипыНоменклатуры.Листовая);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Поганажная),Перечисления.ТипыНоменклатуры.Поганажная);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Штучная),Перечисления.ТипыНоменклатуры.Штучная);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Массив),Перечисления.ТипыНоменклатуры.Массив);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Прочее),Перечисления.ТипыНоменклатуры.Прочее);
		
		Возврат стСписокИмен;
	КонецЕсли;
	
КонецФункции // ПолучитьСписокИменРеквизитов()

Процедура ПолучитСписокРеквизитовДляНормВремени(мСписокИмен) Экспорт

	мСписокИмен.Добавить("ПлюсДнейРКД");
	мСписокИмен.Добавить("ПлюсДнейПКД");
	мСписокИмен.Добавить("КоличествоЗадачСозданиеЗамеров");
	мСписокИмен.Добавить("КоличествоЗадачПКДВРаботе");
	мСписокИмен.Добавить("КоличествоЗадачНаПаузе");

КонецПроцедуры    

Функция ПолучитьНаименованиеРеквизитаЕдиницы(ТипНоменклатурв) Экспорт
	
	Если ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Листовая Тогда
		Возврат "ЕдиницаПлощади"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Поганажная Тогда	
		Возврат "ЕдиницаДлины"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Штучная Тогда	
		Возврат "ЕдиницаШтуки"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Массив Тогда	
		Возврат "ЕдиницаМассива"	
	КонецЕсли;	
	
	Возврат "";
КонецФункции // ПолучитьНаименованиеРеквизитаНормыРасхода()

Функция ПолучитьНаименованиеРеквизитаНормыРасхода(ТипНоменклатурв) Экспорт
	
	Если ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Листовая Тогда
		Возврат "НормаРасходаЛистовых"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Поганажная Тогда	
		Возврат "НормаРасходаПоганажных"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Массив Тогда	
		Возврат "НормаРасходаМассива"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Штучная Тогда	
		Возврат "НормаРасходаШтучных"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Прочее Тогда	
		Возврат "НормаРасходаПрочих"	
	КонецЕсли;	
	
КонецФункции // ПолучитьНаименованиеРеквизитаНормыРасхода()

Функция ПолучитьНачалаРабочегоДня() Экспорт

	Возврат "НачалаРабочегоДня";	

КонецФункции // ПолучитьНачалаРабочегоДня() 

Функция ПолучитьОкончаниеРабочегоДня() Экспорт

	Возврат "ОкончаниеРабочегоДня";	

КонецФункции // ПолучитьОкончаниеРабочегоДня() 

Функция ПолучитьНачалаПерерыва() Экспорт

	Возврат "НачалаПерерыва";	

КонецФункции // ПолучитьНачалаПерерыва() 

Функция ПолучитьОкончаниеПерерыва() Экспорт

	Возврат "ОкончаниеПерерыва";	

КонецФункции // ПолучитьОкончаниеПерерыва() 

Функция ПолучитьИмяНастройкиСтараяЦена()

	Возврат "ПериодВДняхСтараяЦена";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена() 

Функция ПолучитьИмяИнтервалОпросаСообщений()

	Возврат "ИнтервалОпросаСообщений";	

КонецФункции // ПолучитьИмяИнтервалОпросаСообщений()

Функция ПолучитьИмяУчетнаяЗаписьОтправкиСообщения() Экспорт

	Возврат "УчетнаяЗаписьОтправкиСообщения";	

КонецФункции // ПолучитьИмяУчетнаяЗаписьОтправкиСообщения()

Функция ПолучитьИмяТемаОтправкиСообщения() Экспорт

	Возврат "ТемаОтправкиСообщения";	

КонецФункции // ПолучитьИмяТемаОтправкиСообщения()

Функция ПолучитьИмяШаблонОтправкиТекстаСообщения() Экспорт

	Возврат "ШаблонОтправкиТекстаСообщения";	

КонецФункции // ПолучитьИмяШаблонОтправкиТекстаСообщения()

Функция ПолучитьИмяНастройкиДатаСозданияКлючаAPI() Экспорт

	Возврат "ДатаСозданияКлючаAPI";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяПутьККорневойПапкеPDM() Экспорт

	Возврат "КореньПапкиPDM";	

КонецФункции // ПолучитьИмяПутьКПапкеPDM()

Функция ПолучитьИмяПутьКВремяОпросаФайлов() Экспорт

	Возврат "ВремяОпросаФайлов";	

КонецФункции // ПолучитьИмяПутьКПапкеPDM()

Функция ПолучитьИмяПутьКАдрес_API_Telegramm() Экспорт

	Возврат "Адрес_API_Telegramm";	

КонецФункции // ПолучитьИмяПутьКПапкеPDM()

Функция НаименованиеДоскиДляТЗ() Экспорт

	Возврат "ТЗ_Дизайнер";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеURLБазыЗнаний() Экспорт

	Возврат "URLБазыЗнаний";	

КонецФункции // НаименованиеURLБазыЗнаний()  

Функция НаименованиеПапкаДляРазмещенияКомпозиций() Экспорт

	Возврат "ПапкаДляРазмещенияКомпозиций";	

КонецФункции // НаименованиеURLБазыЗнаний()  

Функция НаименованиеПриУтвержденииПереноситьИзПапки() Экспорт

	Возврат "ПриУтвержденииПереноситьИзПапки";	

КонецФункции // НаименованиеURLБазыЗнаний()  

Функция НаименованиеПриУтвержденииУдалятьВПапке() Экспорт

	Возврат "ПриУтвержденииУдалятьВПапке";	

КонецФункции // НаименованиеURLБазыЗнаний()  

Функция НаименованиеПапкаДляРазмещенияТЗ() Экспорт

	Возврат "ПапкаДляРазмещенияТЗ";	

КонецФункции // НаименованиеURLБазыЗнаний()  

Функция НаименованиеАвторИсполненияБэгТрека() Экспорт

	Возврат "АвторИсполненияБэгТрека";	

КонецФункции // НаименованиеАвторИсполненияБэгТрека()  

Функция НаименованиеДоскиДляПроизводства() Экспорт

	Возврат "ПроизводствоНаименованиеДоски";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеКолонкиПриостановкаПроизводства() Экспорт

	Возврат "ПриостановкаПроизводства";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеКолонкиОжиданиеПроизводства() Экспорт

	Возврат "ОжиданиеПроизводства";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеКолонкиОжиданиеГЧ() Экспорт

	Возврат "ОжиданиеГЧ";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеКолонкиХранениеНаСкладе() Экспорт

	Возврат "ХранениеНаСкладе";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеКолонкиДляПроизводствоВМонтаж() Экспорт

	Возврат "ПроизводствоВМонтаж";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеКолонкиДляВозвратаТЗ() Экспорт

	Возврат "ТЗ_ДизайнерВозврат";	

КонецФункции // НаименованиеКолонкиДляВозвратаТЗ()

Функция НаименованиеКолонкиДляСтадияСогласование() Экспорт

	Возврат "СтадияСогласование";	

КонецФункции // НаименованиеКолонкиДляСтадияСогласование()

Функция НаименованиеКолонкиДляСтадияСогласовано() Экспорт

	Возврат "СтадияСогласовано";	

КонецФункции // НаименованиеКолонкиДляСтадияСогласование()

Функция НаименованиеКолонкиДляСтадияПодтвержденияТЗ() Экспорт

	Возврат "СтадияПодтвержденияТЗ";	

КонецФункции // НаименованиеКолонкиДляСтадияПодтвержденияТЗ()

Функция НаименованиеКолонкиДляСтадияТЗ() Экспорт

	Возврат "СтадияТЗ";	

КонецФункции // СтадияТЗ()    

Функция НаименованиеКолонкиДляОжиданияТЗ() Экспорт

	Возврат "ТЗ_ДизайнерОжидание";	

КонецФункции // НаименованиеКолонкиДляОжиданияТЗ()

Функция НаименованиеКолонкиДляТегаКомментарий() Экспорт

	Возврат "ТегКомментарий";	

КонецФункции // НаименованиеКолонкиДляОжиданияТЗ()

Функция ПолучитьНазваниеОрганизации() Экспорт

	Возврат "НазваниеОрганизации";	

КонецФункции // ПолучитьИмяПутьКПапкеPDM()
